In [1]:
%matplotlib inline
import sys
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
list=pd.DataFrame(np.arange(1,12,1))
list

     0
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11

In [3]:
list.drop([2,3,6], axis=0)

     0
0    1
1    2
4    5
5    6
7    8
8    9
9   10
10  11

Let's fill in those spaces with nan values now

In [4]:
list.drop([2,3,6], axis=0)

     0
0    1
1    2
4    5
5    6
7    8
8    9
9   10
10  11

In [6]:
?list